Cinema/src/Reports/РейтингIMDb/РейтингIMDb.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РейтингIMDb</name>
</mdclass:Report>

Cinema/src/InformationRegisters/ДатыСкачиванияФильмов/ДатыСкачиванияФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыСкачиванияФильмов</name>
  <resources>
    <name>ДатаСкачивания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/InformationRegisters/СтраныПроизводители/СтраныПроизводители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтраныПроизводители</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/InformationRegisters/ЖанрыФильмов/ЖанрыФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖанрыФильмов</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Жанр</name>
    <type>
      <types>CatalogRef.Жанры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/Reports/РейтингIMDb/ManagerModule.bsl
Функция ПолучитьТаблицуФильмовПоIMDb(ЕстьВФильмотеке = Неопределено, ПредельноеКоличествоСтрок = 100) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	ВЫРАЗИТЬ(Фильмы.Комментарий КАК СТРОКА(200)) КАК Комментарий,
		|	Фильмы.Наименование + ВЫБОР
		|		КОГДА Фильмы.ОригинальноеНазвание = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" ("" + Фильмы.ОригинальноеНазвание + "")""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Фильмы.Формат3D
		|			ТОГДА "" 3D""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НаименованиеФильма,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	ЕСТЬNULL(ДатыСкачиванияФильмов.ДатаСкачивания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСкачивания,
		|	Фильмы.ЕстьВФильмотеке КАК ЕстьВФильмотеке
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыСкачиванияФильмов КАК ДатыСкачиванияФильмов
		|		ПО Фильмы.Ссылка = ДатыСкачиванияФильмов.Фильм
		|ГДЕ
		|	НЕ Фильмы.ЭтоГруппа
		|	И НЕ Фильмы.ПометкаУдаления
		|	И Фильмы.Комментарий ПОДОБНО ""%IMDb [0-9].[0-9]%""";
	
	Если ТипЗнч(ЕстьВФильмотеке) = Тип("Булево") Тогда
		Если ЕстьВФильмотеке = Истина Тогда
			Запрос.Текст = Запрос.Текст + "
				|	И Фильмы.ЕстьВФильмотеке = ИСТИНА";
		Иначе
			Запрос.Текст = Запрос.Текст + "
				|	И Фильмы.ЕстьВФильмотеке = ЛОЖЬ";
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("IMDb", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 2, ДопустимыйЗнак.Любой)));
	
	Для каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		ПреобразоватьIMDbКЧислу(СтрокаТаблицыДанных);
	КонецЦикла;
	
	Для каждого УдаляемаяСтрока Из ТаблицаДанных.НайтиСтроки(Новый Структура("IMDb", 0)) Цикл
		ТаблицаДанных.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаIMDb.Фильм КАК Фильм,
		|	ТаблицаIMDb.IMDb КАК IMDb,
		|	ТаблицаIMDb.НаименованиеФильма КАК НаименованиеФильма,
		|	ТаблицаIMDb.Наименование КАК Наименование,
		|	ТаблицаIMDb.ДатаВыхода КАК ДатаВыхода,
		|	ТаблицаIMDb.ДатаСкачивания КАК ДатаСкачивания,
		|	ТаблицаIMDb.ЕстьВФильмотеке КАК ЕстьВФильмотеке
		|ПОМЕСТИТЬ ВТ_ТаблицаIMDb
		|ИЗ
		|	&ТаблицаIMDb КАК ТаблицаIMDb
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ //ПЕРВЫЕ_100
		|	ВТ_ТаблицаIMDb.Фильм КАК Фильм,
		|	ВТ_ТаблицаIMDb.IMDb КАК IMDb,
		|	ВТ_ТаблицаIMDb.НаименованиеФильма КАК НаименованиеФильма,
		|	ВТ_ТаблицаIMDb.Наименование КАК Наименование,
		|	ВТ_ТаблицаIMDb.ДатаВыхода КАК ДатаВыхода,
		|	ВТ_ТаблицаIMDb.ДатаСкачивания КАК ДатаСкачивания,
		|	ВТ_ТаблицаIMDb.ЕстьВФильмотеке КАК ЕстьВФильмотеке
		|ИЗ
		|	ВТ_ТаблицаIMDb КАК ВТ_ТаблицаIMDb
		|
		|УПОРЯДОЧИТЬ ПО
		|	IMDb УБЫВ,
		|	НаименованиеФильма";
	Запрос.УстановитьПараметр("ТаблицаIMDb", ТаблицаДанных);
	
	Если ПредельноеКоличествоСтрок > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПЕРВЫЕ_100", "ПЕРВЫЕ " + Формат(ПредельноеКоличествоСтрок, "ЧГ=0"));
	КонецЕсли;
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанных.Фильм КАК Фильм,
		|	ТаблицаДанных.НаименованиеФильма КАК НаименованиеФильма,
		|	ТаблицаДанных.Наименование КАК Наименование,
		|	ТаблицаДанных.ДатаВыхода КАК ДатаВыхода,
		|	ТаблицаДанных.ДатаСкачивания КАК ДатаСкачивания,
		|	ТаблицаДанных.ЕстьВФильмотеке КАК ЕстьВФильмотеке,
		|	ТаблицаДанных.IMDb КАК IMDb
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	СтраныПроизводители.Страна.Представление КАК Страна
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	ЖанрыФильмов.Жанр.Представление КАК Жанр
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Фильм КАК Фильм,
		|	Фильмы.НаименованиеФильма КАК НаименованиеФильма,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.ДатаСкачивания КАК ДатаСкачивания,
		|	Фильмы.IMDb КАК IMDb,
		|	Фильмы.ЕстьВФильмотеке КАК ЕстьВФильмотеке,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Жанр,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Страна
		|ИЗ
		|	Фильмы КАК Фильмы
		|
		|УПОРЯДОЧИТЬ ПО
		|	IMDb УБЫВ";
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	НаибольшийИндекс  = РезультатыЗапроса.ВГраница();
	ТаблицаДанных     = РезультатыЗапроса.Получить(НаибольшийИндекс).Выгрузить();
	СтруктураПолей    = Новый Структура("Жанр, Страна");
	СтруктураПоиска   = Новый Структура("Фильм");
	
	Для каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицыДанных);
		ТекущийИндекс = НаибольшийИндекс;
	
		Для каждого КлючИЗначение Из СтруктураПолей Цикл
			
			ТекущийИндекс   = ТекущийИндекс - 1;
			Выборка         = РезультатыЗапроса.Получить(ТекущийИндекс).Выбрать();
			ЗначениеКолонки = "";
			
			Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
				ЗначениеКолонки = ЗначениеКолонки + ?(ПустаяСтрока(ЗначениеКолонки), "", ", ") + Выборка[КлючИЗначение.Ключ];
			КонецЦикла;
			 
			СтрокаТаблицыДанных[КлючИЗначение.Ключ] = ЗначениеКолонки;
			
		КонецЦикла;
	
	КонецЦикла;

	Возврат ТаблицаДанных;

КонецФункции

Процедура ПреобразоватьIMDbКЧислу(СтрокаТаблицыДанных)
	
	Вхождение = СтрНайти(СтрокаТаблицыДанных.Комментарий, "IMDb");
	ИМДбСтр   = "";
	Если Вхождение = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока   = Сред(СтрокаТаблицыДанных.Комментарий, Вхождение + 5);
	ДлинаСтроки = СтрДлина(ТекСтрока);
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		ТекСимвол = Сред(ТекСтрока, ИндексСимвола, 1);
		СимволКод = КодСимвола(ТекСимвол, 1);
		Если СимволКод > 47 И СимволКод < 58 Тогда
			ИМДбСтр = ИМДбСтр + ТекСимвол;
		ИначеЕсли ТекСимвол = "." Тогда
			ИМДбСтр = ИМДбСтр + ТекСимвол;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ИМДбСтр) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицыДанных.IMDb = Число(ИМДбСтр);
	
КонецПроцедуры
